#+title: User Settings
These user settings run in tandem with the [[https:github.com/otavioschwanck/doom-emacs-on-rails][Ruby on Rails config]] by =@otavioschwanck=.
** Personal Organization
I want my organization to reflect my goals to me in different contexts. Sometimes its review, sometimes to-do. Whatever it is, however, the system should handle anything I throw at it.

Here is my basic file setup.
#+begin_src elisp
(after! org
  (setq
   org-agenda-files
   '("~/org/projects/personal.org" "~/org/projects/projects.org")))
#+end_src

#+RESULTS:
| ~/org/projects/personal.org | ~/org/projects/projects.org |

**** Basic Settings
#+BEGIN_SRC elisp
(after! org
  (setq
   org-agenda-start-day "0d" ;; View my agenda TODAY as the first item
   org-agenda-skip-scheduled-if-done t
   org-agenda-skip-deadline-if-done t
   org-agenda-skip-timestamp-if-done t
   ;; org-agenda-current-time-string " Now "
   ;; org-agenda-breadcrumbs-separator ""
   ;; org-agenda-block-separator '""
   org-agenda-span 1
   ;; org-agenda-compact-blocks t
   )
  )
#+END_SRC

#+RESULTS:
: 1

*** Nov.el

#+begin_src elisp
(after! nov
  :config
    (setq nov-text-width t)
    (setq visual-fill-column-center-text t)
    (add-hook 'nov-mode-hook 'visual-line-mode)
    (add-hook 'nov-mode-hook 'visual-fill-column-mode)
)

#+end_src

#+RESULTS:
| visual-fill-column-mode | visual-line-mode | nov-imenu-setup | hack-dir-local-variables-non-file-buffer | nov-add-to-recentf |

*** Org-Roam-Capture

Org-roam lets you quickly create new nodes (or add to existing ones).

These templates will allow me to rapidly add context-specific items for tracking new characters, locations, details, etc. Rather than creating a session- or campaign-specific org file, the network will let me focus on small things rather than worry about the broad structure. /"Is this detail for character's or plot?/
#+begin_src elisp
;; (after! org-roam
;;   (setq!
;;    org-roam-capture-templates
;;    '(
;;      ("d" "default" plain "%?" :target
;;       (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unnarrowed t)
;;      ("x" "Dungeons & Dragons")
;;      ("dn" "NPC" plain
;;       "* Race\n* Description\n* Circumstances of Encounter"
;;       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unnarrowed t
;;       )
;;      ("dg" "Groups" plain
;;       "* What do they do?\n* Rivals?\n* Where you can find members?\n* Iconography\n* Diposition towards party"
;;       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unnarrowed t
;;       )
;;      ("ds" "Places or Shops" plain
;;       "* Location Details\n* What do they do?\n"
;;       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unnarrowed t
;;       )
;;      ("dc" "Cities, Towns, or Geography" plain
;;       "* Why is mentioned?"
;;       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unnarrowed t
;;       )
;;      ("dq" "Quests or Tasks" plain
;;       "* Who gave it to us?\n* What do we have to do?\n* Where is it?\n* Reward"
;;       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unnarrowed t
;;       )
;;      ("dl" "Loot" plain
;;       "* Description\n* Price or value?\n"
;;       :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n")
;;       :unnarrowed t
;;       )
;;      ))
;;   )
#+end_src

#+RESULTS:
| d | default | plain | %? | :target | (file+head %<%Y%m%d%H%M%S>-${slug}.org #+title: ${title} |
